### 직업 탐구하기 I

In [10]:
import pandas as pd

df = pd.read_csv('../data/occupations.csv')
df.head()

   age gender  occupation
0   24      M  technician
1   53      F       other
2   23      M      writer
3   24      M  technician
4   33      F       other

In [11]:
# 직업으로 groupby
occ_groups = df.groupby('occupation')

In [ ]:
# 정답인데 버전 차이로 실행 오류..
occ_groups.mean().sort_values(by='age')